Repository: taunoe/tauno-monitor
Catalog: po/*.po
Languages: et, ru

source: Serial
et: Jadaühendus
ru: Последовательный порт

source: New Window
et: Uus aken
ru: Новое окно

source: The serial port monitor for Arduino and other embedded development
et: Jadapordi monitor Arduino ja teiste manussüsteemide arenduseks
ru: Монитор последовательного порта для Arduino и разработки микроконтроллеров

source: Features:
et: Omadused:
ru: Особенности:

source: Easy to use
et: Lihtne kasutada
ru: Простота в использовании

source: Customizable colours
et: Muudetavad värvid
ru: Настраиваемые цвета

source: Remembers the last used settings
et: Jätab meelde viimati kasutatud seaded
ru: Запоминает последние использованные настройки (тема, скорость передачи, порт и т. д.)

source: Automatically reconnects to the serial port if the connection is lost
et: Taastab automaatselt ühenduse, kui see on katkenud
ru: Автоматически восстанавливает соединение с последовательным портом при его потере

source: Can log data to a file
et: Logib andmeid faili
ru: Может записывать данные в файл

source: Displays data in different formats: ASCII, BIN, OCT or DEC
et: Kuvab andmeid erinevas formaadis: ASCII, BIN, OCT või DEC
ru: Отображает данные в различных форматах: ASCII, BIN, OCT или DEC

source: Can open multiple instances
et: Saab avada mitu akent
ru: Может открывать несколько экземпляров

source: Depending on your system you may need to add a user to dialout group to open serial ports: <code>sudo usermod -a -G dialout $USER</code>&gt;
ru: В зависимости от системы может понадобиться добавить пользователя в группу dialout для открытия портов: <code>sudo usermod -a -G dialout $USER</code>&gt;

source: Light mode
et: Hele teema
ru: Светлый режим

source: Dark mode
et: Tume teema
ru: Тёмный режим

source: Preferences
et: Seaded
ru: Параметры

source: Log file
et: Logi fail
ru: Файл журнала

source: Bug fix
et: Vea parandus
ru: Исправление ошибок

source: Added tool to find baud rate
et: Lisatud tööriist baudikiiruse leidmiseks
ru: Добавлен инструмент поиска скорости передачи

source: Added a Sidebar to display device info
et: Lisatud külgpaneel seadme info kohta
ru: Добавлена боковая панель для отображения информации об устройстве

source: Added german translation
ru: Добавлен перевод на немецкий язык

source: Added "New Window" in menu
ru: Добавлено "Новое окно" в меню

source: Separated preferences logic and ui
ru: Отделена логика настроек от интерфейса

source: Preferences can now be translated
ru: Теперь настройки можно переводить

source: Turns the logging switch off when the logging folder does not have write permission.
ru: Отключает переключатель журналирования, когда папка журнала не имеет прав на запись.

source: New Window fix
ru: Исправление "Новое окно"

source: Added the ability to open multiple instances of the app
ru: Добавлена возможность открывать несколько экземпляров приложения

source: Added BIN, DEC and OCT data formats
ru: Добавлены форматы данных BIN, DEC и OCT

source: Bug fixes
ru: Исправления ошибок

source: New app icon
et: Uus ikoon
ru: Новая иконка приложения

source: Runtime-version 48
ru: Среда выполнения версии 48

source: Advandced Serial settings
ru: Расширенные настройки последовательного порта

source: Show and select line ends (TX and RX).
ru: Показывает и выбирает окончания строк (TX и RX).

source: New baud rates
ru: Новые скорости передачи

source: Select line ending
ru: Выбор окончания строки

source: Added new baudrate: 1500000
ru: Добавлена новая скорость передачи: 1500000

source: org.gnome.Platform ver 47
ru: org.gnome.Platform версии 47

source: Improved Estonian translation
ru: Улучшен перевод на эстонский язык

source: Reduced height of the preferences window.
ru: Уменьшена высота окна настроек.

source: Added Russian translation
ru: Добавлен перевод на русский язык

source: Started Estonian translation.
ru: Начат перевод на эстонский язык.

source: Logs HEX data.
et: Logib andmeid HEX kujul.
ru: Запись данных в формате HEX.

source: User can customise text view colors.
et: Kasutaja saab kohandada tekstivaate värve.
ru: Пользователь может настраивать цвета отображения текста.

source: Improved logging.
ru: Улучшена система ведения журнала.

source: Coloured output.
et: Värviline väljund.
ru: Вывод получил цветовое оформление.

source: Auto reconnects to the serial port.
et: Taastab ühenduse.
ru: Автоматическое восстановление соединения с последовательным портом.

source: Logging data to a file.
et: Logib andmed faili.
ru: Запись данных в файл.

source: Changed back to tauno-monitor.
ru: Возвращено название tauno-monitor.

source: Removed hyphen(`-`) and underscore (`_`) from app id.
ru: Удалены дефис (`-`) и подчеркивание (`_`) из ID приложения.

source: Replaced App ID hyphen(`-`) with underscore (`_`).
ru: Заменен дефис (`-`) на подчеркивание (`_`) в ID приложения.

source: Added "Clear" button.
et: Lisatud ekraani puhastus nupp
ru: Добавлена кнопка "Очистить".

source: Added timestamp setting.
et: Lisatud ajatempel
ru: Добавлена настройка временной метки.

source: Automatically scan ports if connection is lost.
ru: Автоматическое сканирование портов при потере соединения.

source: Automatically closes the serial port if the connection is lost.
ru: Автоматическое закрытие последовательного порта при потере соединения.

source: Added RX data HEX mode
ru: Добавлен режим данных RX в формате HEX

source: Enter == Send
ru: Enter == Отправить

source: Reads bytes, not lines!
ru: Читает байты, а не строки!

source: Saves text size. Notifications settings.
ru: Сохраняет размер текста. Параметры уведомлений.

source: Added a guide: what to do when serial ports are not available
ru: Добавлено руководство: что делать, если последовательные порты недоступны

source: Meta info fixes
ru: Исправления метаданных

source: First release
ru: Первый релиз

source: Port:
ru: Порт:

source: not available
et: pole saadaval
ru: недоступен

source: Update
et: Uuenda
ru: Обновить

source: Baud Rate:
et: Kiirus
ru: Скорость передачи:

source: Open
et: Ava
ru: Открыть

source: Menu
et: Menüü
ru: Главное меню

source: Device info
et: Seadme info
ru: Информация об устройстве

source: Clear screen
et: Puhasta ekraan
ru: Очистить экран

source: Write logs to file
et: Kirjuta logid faili
ru: Записывать журнал в файл

source: Log
et: Logi
ru: Журнал

source: Name:
et: Nimi:
ru: Имя:

source: Description:
et: Kirjeldus:
ru: Описание:

source: Vendor ID:
et: Tarnija ID:
ru: ID производителя:

source: Vendor:
et: Tarnija:
ru: Производитель:

source: Product ID:
et: Toote ID
ru: ID продукта:

source: Product:
et: Toode:
ru: Продукт:

source: Serial Number:
et: Seerianumber:
ru: Серийный номер:

source: USB Location:
et: USB asukoht:
ru: Расположение USB:

source: Manufacturer:
et: Valmistaja:
ru: Изготовитель:

source: Interface:
et: Liides:
ru: Интерфейс:

source: Unable to open serial ports! Learn how to enable ->
et: Jadaporte ei saanud avada! Uuri, kuidas lubada ->
ru: Не удалось открыть последовательные порты! Узнайте, как это сделать ->

source: Guide
et: Juhend
ru: Руководство

source: Enter cmd
et: Sisesta käsk
ru: Введите команду

source: End of line of transmitted (TX) data
et: Edastatud (TX) andmete rea lõpp
ru: Окончание строки переданных (TX) данных

source: Send
et: Saada
ru: Отправить

source: _New Window
et: _Uus aken
ru: _Новое окно

source: _Guide
et: _Juhend
ru: _Руководство

source: _Find Baud Rate
et: _Leia baudikiirus
ru: _Найти скорость

source: _Preferences
et: _Seaded
ru: _Параметры

source: _Keyboard Shortcuts
et: _Kiirklahvid
ru: _Комбинации клавиш

source: _About
et: _Teave
ru: _О приложении

source: To make serial ports visible to the app add the user to 'dialout' group.
et: Lisa kasutaja 'dialout' gruppi, et rakendus näeks jadaporte.
ru: Чтобы сделать последовательные порты видимыми для приложения, добавьте пользователя в группу 'dialout'.

source: Please open Terminal and type:
et: Ava termainal ja sisesta käsud:
ru: Пожалуйста, откройте терминал и введите:

source: You will need to log out and log back in again (or reboot) for the user group changes to take effect.
et: Pead välja- ja uuesti sisse logima, et muudatused rakenduksid.
ru: Вам нужно будет выйти из системы и снова войти в нее (или перезагрузиться), чтобы изменения в группах пользователей вступили в силу.

source: Ubuntu users also must enable "Access USB hardware directly" in the Ubuntu Store Software store on or on the command line.
et: Ubuntu kasutajad peavad lubama "Access USB hardware directly" Ubuntu rakenduste poest või käsurealt
ru: Пользователи Ubuntu также должны дать "Прямой доступ к оборудованию USB" в магазине Ubuntu Store или через команду в терминале.

source: More information on:
et: Rohkem infot:
ru: Больше информации на:

source: Close window
et: Sule aken
ru: Закрыть окно

source: Appearance
et: Välimus
ru: Внешний вид

source: Text Size
et: Teksti suurus
ru: Размер текста

source: Dark Mode
et: Tume teema
ru: Тёмная тема

source: Notifications
et: Märguanded
ru: Уведомления

source: Data View
et: Andmed
ru: Отображение данных

source: Reset
et: Lähtesta
ru: Сброс

source: Timestamp Color
et: Ajatempli värv
ru: Цвет временной метки

source: Arrow Color
et: Noole värv
ru: Цвет стрелки

source: Transmitted (TX) Data Color
et: Edastatud (TX) andmete värv
ru: Цвет переданных (TX) данных

source: Received (RX) Data Color
et: Vastuvõetud (RX) andmete värv
ru: Цвет принятых (RX) данных

source: Show Line Endings
et: Näita rea lõppe
ru: Показывать окончания строк

source: Line End Color
et: Rea lõpu värv
ru: Цвет окончания строки

source: Logging
et: Logimine
ru: Журналирование

source: Folder
et: Katalog
ru: Папка

source: Select Folder
et: Vali katalog
ru: Выбрать папку

source: Data Bits
et: Andmebitid
ru: Биты данных

source: Parity
et: Paarsus
ru: Чётность

source: Stop Bits
et: Stopp-bitid
ru: Стоп-биты

source: Done
et: Valmis
ru: Готово

source: Best match: {baud} baud
et: Parim tulemus kiirusel {baud}
ru: Лучшее совпадение: {baud} бод

source: Trying {baudrate} baud...
et: Proovin kiirust {baudrate}
ru: Проверяется {baudrate} бод...

source: Connect the device to the port!
et: Ühenda seade porti!
ru: Подключите устройство к порту!

source: Find the Baud Rate
et: Leia baudikiirus
ru: Найти скорость передачи

source: Scan
et: Skaneeri
ru: Сканировать

source: Click <b>Scan</b> to start
et: Vajuta <b>Skaneeri</b> alustamiseks
ru: Нажмите <b>Сканировать</b> для начала

source: Use this baud rate
et: Kasuta seda baudikiirust
ru: Использовать эту скорость передачи

source: Hides unusable ports (without PID/VID number)
et: Peidab pordid mida ei saa kasutada

source: Updated Estonian translation
et: Uuendatud eesti keele tõlge

source: New USB IDS database (Version: 2025.07.26)
et: Uus USB IDS andmebaas

source: Line end:
et: Rea lõpp:

source: End of line of received (rX) data
et: Vastuvõetud (RX) andmete rea lõpp

source: Format
et: Vorming

source: Show Timestamp
et: Näita ajatemplit

source: Show Arrow
et: Näita noolt
